InformationRegisters/КанбанДоски.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КанбанДоски</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разделитель</Name>
					<Comment>0 без разделителей, 1 Проект, 2 Сотрудник</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяКартинкиКорзины</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КанбанПрава.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КанбанПрава</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Просмотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Добавление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Измениение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Удаление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Доска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КанбанПереходКарточки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КанбанПереходКарточки</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерВКолонке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИДКудаДорожка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИДКудаКолонка</Name>
					<Comment>"1"  выполнена. "100"  корзина "200" приостановлена.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИДПерехода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИДКарточка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КанбанКолонки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КанбанКолонки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВРаботе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействиеПриПопадании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Доска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапрещенИнтерактивныйПереход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапрещенИнтерактивныйУход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛимитКарточек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛимитЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяКомментарий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КанбанКарточки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КанбанКарточки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Доска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цвет</Name>
					<Comment>ПустаяСтрока по умолчанию</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТЗ_Изделий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТЗ_Изделий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АвторСоздания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>1 принят, 2 отказ, 0 Ожидание, -1 новый</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФайлТЗ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектТЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/омКанбанДоскиНаСервере/Ext/Module.bsl
Функция ПолучитьДоскиСУчетомПрав(Пользователь = Неопределено) Экспорт

	Если Пользователь = Неопределено Тогда
	
		Пользователь = ПараметрыСеанса.ТекущийПользователь;	
	
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КанбанДоски.УИД КАК УИД,
		|	КанбанДоски.Наименование КАК Наименование
		|ИЗ
		|	РегистрСведений.КанбанДоски КАК КанбанДоски
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанПрава КАК КанбанПрава
		|		ПО КанбанДоски.УИД = КанбанПрава.Доска
		|			И (КанбанПрава.Пользователь = &Пользователь)
		|ГДЕ
		|	(КанбанПрава.Просмотр
		|			ИЛИ КанбанПрава.Добавление
		|			ИЛИ КанбанПрава.Измениение
		|			ИЛИ КанбанПрава.Удаление)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	стДоски = Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл
		стДоски.Добавить(Выборка.УИД, Выборка.Наименование);
	КонецЦикла;
	
	Возврат стДоски;	

КонецФункции // ПолучитьДоскиСучетомПрав()

Процедура ЗаписатПереход(Данные, УИДДоски, стДополнительныеДанные = Неопределено) Экспорт
	
	УИДКарточка 	= Данные.Получить("itemId");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КанбанПереходКарточкиСрезПоследних.УИДКудаДорожка КАК УИДКудаДорожка,
		|	КанбанПереходКарточкиСрезПоследних.УИДКудаКолонка КАК УИДКудаКолонка,
		|	КанбанПереходКарточкиСрезПоследних.НомерВКолонке КАК НомерВКолонке,
		|	КанбанПереходКарточкиСрезПоследних.Окончание КАК Окончание
		|ИЗ
		|	РегистрСведений.КанбанПереходКарточки.СрезПоследних(, УИДКарточка = &УИДКарточка) КАК КанбанПереходКарточкиСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КанбанКолонки.ДействиеПриПопадании КАК ДействиеПриПопадании,
		|	КанбанКолонки.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.КанбанКолонки КАК КанбанКолонки
		|ГДЕ
		|	КанбанКолонки.УИД = &categoryId
		|	И НЕ КанбанКолонки.ДействиеПриПопадании = """"";
	
	Запрос.УстановитьПараметр("УИДКарточка", УИДКарточка);
	Запрос.УстановитьПараметр("categoryId", Данные.Получить("categoryId"));
	
	Результат = Запрос.ВыполнитьПакет();
	Выборка = Результат[0].Выбрать();
	
	стПараметры = Новый Структура();
	
	Пока Выборка.Следующий() Цикл
		
		стПараметры.Вставить("текНомерВКолонке", 	Выборка.НомерВКолонке);
	    стПараметры.Вставить("текУИДКудаКолонка", 	Выборка.УИДКудаКолонка);
	    стПараметры.Вставить("текУИДКудаДорожка", 	Выборка.УИДКудаДорожка);
	    стПараметры.Вставить("текОкончание", 		Выборка.Окончание);
		
	КонецЦикла;
	
	Результат = Запрос.ВыполнитьПакет();
	Выборка = Результат[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
	    стПараметры.Вставить("Действие", 	Выборка.ДействиеПриПопадании);
	    стПараметры.Вставить("Статус",		Выборка.Статус);
		
	КонецЦикла;
	                                	
	стПараметры.Вставить("новНомерВКолонке", 	Данные.Получить("insertBeforeIndex"));
	стПараметры.Вставить("новУИДКудаКолонка", 	Данные.Получить("categoryId"));
	стПараметры.Вставить("новУИДКудаДорожка", 	Данные.Получить("trackId"));
	стПараметры.Вставить("новОкончание", 		Ложь);
	стПараметры.Вставить("УИДКарточка", 		УИДКарточка);
	
	стПараметры.новНомерВКолонке = ?(стПараметры.новНомерВКолонке = -1, 0, стПараметры.новНомерВКолонке);
	
	МенеджерЗаписиПереход = РегистрыСведений.КанбанПереходКарточки.СоздатьМенеджерЗаписи();
	МенеджерЗаписиПереход.Период			= ТекущаяДата();
	МенеджерЗаписиПереход.УИДПерехода 		= Новый УникальныйИдентификатор();
	МенеджерЗаписиПереход.УИДКарточка 		= УИДКарточка;
	МенеджерЗаписиПереход.УИДКудаКолонка 	= стПараметры.новУИДКудаКолонка;
	МенеджерЗаписиПереход.УИДКудаДорожка 	= стПараметры.новУИДКудаДорожка;
	МенеджерЗаписиПереход.Пользователь 		= ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписиПереход.НомерВКолонке 	= стПараметры.новНомерВКолонке;
	МенеджерЗаписиПереход.Окончание 		= стПараметры.новОкончание;
	
	МенеджерЗаписиПереход.Записать();
	
	ИзменитьНомерВКолонкеПослеПеремещения(стПараметры);
	
	ИнкриментВерсии(УИДДоски);
	
	Если стПараметры.Свойство("Действие") Тогда
	
		Если НЕ ПустаяСтрока(стПараметры.Действие) Тогда
		
			мПараметры = Новый Массив(5);
			мПараметры[0] = стПараметры.новНомерВКолонке;
			мПараметры[1] = стПараметры.новУИДКудаКолонка;
			мПараметры[2] = стПараметры.новУИДКудаДорожка;
			мПараметры[3] = стПараметры.УИДКарточка;
			мПараметры[4] = стПараметры.Статус;
			
			ОбщегоНазначения.ВыполнитьМетодКонфигурации("омКанбанДоскиНаСервере." + стПараметры.Действие, мПараметры);	
		
		КонецЕсли;	
	
	КонецЕсли;
	
КонецПроцедуры // ЗаписатПереход()

Процедура НазначениеСтадииКомплекту(новНомерВКолонке, новУИДКудаКолонка, новУИДКудаДорожка, УИДКарточка, Статус) Экспорт
	
	//УстановитьПривилегированныйРежим(Истина);

	//Комплект = ПолучитьРесурсПоУИД(УИДКарточка);
	//
	//Если ЗначениеЗаполнено(Комплект) Тогда
	//	
	//	НоваяСтадия = омЗадачиПКДСервер.ОпределитьСтадиюПоСтатусуЗадачи(Статус);
	//	
	//	стПараметры = Новый Структура("Комплект, ТекущаяСтадия", Комплект, НоваяСтадия);
	//	РегистрыСведений.ДанныеКомплекта.ИзменитьДанныеКомплекта(стПараметры);
	//	
	//КонецЕсли;
	
КонецПроцедуры

Процедура ИзменитьНомерВКолонкеПослеПеремещения(стПараметры)

	Если стПараметры.текУИДКудаКолонка = стПараметры.новУИДКудаКолонка И стПараметры.текУИДКудаДорожка = стПараметры.новУИДКудаДорожка Тогда
		
		Если НЕ стПараметры.новНомерВКолонке = стПараметры.текНомерВКолонке Тогда
			ПеремещениеВОднойКолонкеИДорожке(стПараметры.текУИДКудаКолонка, стПараметры.текУИДКудаДорожка, стПараметры.новНомерВКолонке, стПараметры.текНомерВКолонке, стПараметры.УИДКарточка);	
		КонецЕсли;	
		
	Иначе
		
		
		
	КонецЕсли; 

КонецПроцедуры

Процедура ПеремещениеВОднойКолонкеИДорожке(УИДКудаКолонка, УИДКудаДорожка, новНомерВКолонке, текНомерВКолонке, УИДКарточка)

	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
    ТД 					= ТекущаяДата();
	
	Если новНомерВКолонке < текНомерВКолонке Тогда
	
		ПервыйНомер 	= новНомерВКолонке;
		ПоследнийНомер 	= текНомерВКолонке;
		Индекс 			= 1;
	
	Иначе
	
		ПервыйНомер 	= текНомерВКолонке;
		ПоследнийНомер 	= новНомерВКолонке;
		Индекс 			= -1;
	
	КонецЕсли; 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КанбанПереходКарточкиСрезПоследних.УИДКарточка КАК УИДКарточка,
		|	КанбанПереходКарточкиСрезПоследних.НомерВКолонке КАК НомерВКолонке,
		|	КанбанПереходКарточкиСрезПоследних.Окончание КАК Окончание,
		|	КанбанПереходКарточкиСрезПоследних.УИДКудаДорожка КАК УИДКудаДорожка,
		|	КанбанПереходКарточкиСрезПоследних.УИДПерехода КАК УИДПерехода
		|ИЗ
		|	РегистрСведений.КанбанПереходКарточки.СрезПоследних(, ) КАК КанбанПереходКарточкиСрезПоследних
		|ГДЕ
		|	КанбанПереходКарточкиСрезПоследних.НомерВКолонке >= &ПервыйНомер
		|	И КанбанПереходКарточкиСрезПоследних.НомерВКолонке <= &ПоследнийНомер
		|	И КанбанПереходКарточкиСрезПоследних.УИДКарточка <> &УИДКарточка
		|	И КанбанПереходКарточкиСрезПоследних.УИДКудаДорожка = &УИДКудаДорожка
		|	И КанбанПереходКарточкиСрезПоследних.УИДКудаКолонка = &УИДКудаКолонка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерВКолонке";
	
	Запрос.УстановитьПараметр("ПервыйНомер", 	ПервыйНомер);
	Запрос.УстановитьПараметр("ПоследнийНомер", ПоследнийНомер);
	Запрос.УстановитьПараметр("УИДКудаКолонка", УИДКудаКолонка);
	Запрос.УстановитьПараметр("УИДКудаДорожка", УИДКудаДорожка);
	Запрос.УстановитьПараметр("УИДКарточка", 	УИДКарточка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	
	Пока Выборка.Следующий() Цикл
		

		МенеджерЗаписи = РегистрыСведений.КанбанПереходКарточки.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.НомерВКолонке 	= Выборка.НомерВКолонке + Индекс;
		МенеджерЗаписи.Окончание 		= Выборка.Окончание;
		МенеджерЗаписи.Период 			= ТД;
		МенеджерЗаписи.УИДКарточка 		= Выборка.УИДКарточка;
		МенеджерЗаписи.Пользователь 	= ТекущийПользователь;
		МенеджерЗаписи.УИДКудаКолонка 	= УИДКудаКолонка;
		МенеджерЗаписи.УИДКудаДорожка 	= Выборка.УИДКудаДорожка;
		МенеджерЗаписи.УИДПерехода 		= Новый УникальныйИдентификатор();
		
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	

КонецПроцедуры

Функция ПолучитьНомерВерсии(УИДДоски) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КанбанДоски.НомерВерсии КАК НомерВерсии
		|ИЗ
		|	РегистрСведений.КанбанДоски КАК КанбанДоски
		|ГДЕ
		|	КанбанДоски.УИД = &УИДДоски";
	
	Запрос.УстановитьПараметр("УИДДоски", УИДДоски);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.НомерВерсии;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции // ПолучитьНомерВерсии()

Функция ПолучитьСсылкуПоУИДРеквизита(УИДРеквизита) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КанбанКарточки.Ресурс КАК Ресурс
		|ИЗ
		|	РегистрСведений.КанбанКарточки КАК КанбанКарточки
		|ГДЕ
		|	КанбанКарточки.УИД = &УИДРеквизита";
	
	Запрос.УстановитьПараметр("УИДРеквизита", УИДРеквизита);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ресурс;
	КонецЦикла;   
	
	Возврат Неопределено;

КонецФункции // ПолучитьСсылкуПоУИДРеквизита()

Процедура ПеревестиКарточкуВВыполнено(УИДДоски, Ресурс, Комментарий = "") Экспорт

	УИДКарточка = ПолучитьУИДКарточки(УИДДоски, Ресурс); 
	
	Если ПустаяСтрока(УИДКарточка) Тогда
		Возврат;
	КонецЕсли;
	
	стПараметрыПерехода = омКанбанНачальноеЗаполнение.ПолучитьСтруктуруДляЭлементовКанбана("ПереходКарточки", Комментарий);
	
	стПараметрыПерехода.Доска 			= УИДДоски;
	стПараметрыПерехода.НомерВКолонке 	= 0;
	стПараметрыПерехода.УИДКудаКолонка 	= "1";
	стПараметрыПерехода.УИДКудаДорожка 	= "1";
	стПараметрыПерехода.УИДКарточка 	= УИДКарточка;
	
	УИДПерехода = омКанбанНачальноеЗаполнение.СоздатьДвижениеКарточки(стПараметрыПерехода); 
		
КонецПроцедуры

Процедура ПеревестиКарточкуВСтоп(УИДДоски, Ресурс, Комментарий = "", УИДКарточка = "") Экспорт

	Если ПустаяСтрока(УИДКарточка) Тогда
		УИДКарточка = ПолучитьУИДКарточки(УИДДоски, Ресурс); 
	КонецЕсли;
	
	Если ПустаяСтрока(УИДКарточка) Тогда
		Возврат;
	КонецЕсли;
	
	стПараметрыПерехода = омКанбанНачальноеЗаполнение.ПолучитьСтруктуруДляЭлементовКанбана("ПереходКарточки", Комментарий);
	
	стПараметрыПерехода.Доска 			= УИДДоски;
	стПараметрыПерехода.НомерВКолонке 	= 0;
	стПараметрыПерехода.УИДКудаКолонка 	= "200";
	стПараметрыПерехода.УИДКудаДорожка 	= "1";
	стПараметрыПерехода.УИДКарточка 	= УИДКарточка;
	
	УИДПерехода = омКанбанНачальноеЗаполнение.СоздатьДвижениеКарточки(стПараметрыПерехода); 
		
КонецПроцедуры

Функция ПолучитьУИДКарточки(УИДДоски, Ресурс) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КанбанКарточки.УИД КАК УИД
		|ИЗ
		|	РегистрСведений.КанбанКарточки КАК КанбанКарточки
		|ГДЕ
		|	КанбанКарточки.Доска = &Доска
		|	И КанбанКарточки.Ресурс = &Ресурс";
	
	Запрос.УстановитьПараметр("Доска", 	УИДДоски);
	Запрос.УстановитьПараметр("Ресурс", Ресурс);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.УИД;
	КонецЦикла;
	
    Возврат "";
	
КонецФункции // ПолучитьУИДКарточки()

Функция ИнкриментВерсии(УИДДоски) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.КанбанДоски.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.УИД = УИДДоски;
	
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.НомерВерсии = ?(МенеджерЗаписи.НомерВерсии > 999999999, 1, МенеджерЗаписи.НомерВерсии + 1);
	
	МенеджерЗаписи.Записать();

КонецФункции // ИнкриментВерсии()

Функция ПолучитьКомментарийОбъекта(УИДРеквизита, ТипКанбана) Экспорт

	Запрос = Новый Запрос;
	Если ТипКанбана = "Производство" Тогда
	
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КанбанКарточки.Комментарий КАК Комментарий,
		|	КанбанКарточки.Ресурс КАК ОбъектТЗ,
		|	КанбанКарточки.Ресурс.Наименование КАК ОбъектТЗНаименование
		|ИЗ
		|	РегистрСведений.КанбанКарточки КАК КанбанКарточки
		|ГДЕ
		|	КанбанКарточки.УИД = &УИДРеквизита";
	
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ_Изделий.ОбъектТЗ КАК ОбъектТЗ,
		|	МАКСИМУМ(ТЗ_Изделий.Версия) КАК Версия
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	РегистрСведений.КанбанКарточки КАК КанбанКарточки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТЗ_Изделий КАК ТЗ_Изделий
		|		ПО КанбанКарточки.Ресурс = ТЗ_Изделий.ОбъектТЗ
		|ГДЕ
		|	КанбанКарточки.УИД = &УИДРеквизита
		|
		|СГРУППИРОВАТЬ ПО
		|	ТЗ_Изделий.ОбъектТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗ_Изделий.Комментарий КАК Комментарий,
		|	ТЗ_Изделий.ОбъектТЗ КАК ОбъектТЗ,
		|	ТЗ_Изделий.ОбъектТЗ.Наименование КАК ОбъектТЗНаименование
		|ИЗ
		|	РегистрСведений.ТЗ_Изделий КАК ТЗ_Изделий
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт КАК вт
		|		ПО ТЗ_Изделий.ОбъектТЗ = вт.ОбъектТЗ
		|			И ТЗ_Изделий.Версия = вт.Версия";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("УИДРеквизита", УИДРеквизита);
		
	стВозврата = Новый Структура("УИДРеквизита, ОбъектТЗНаименование, Комментарий, ОбъектТЗ", УИДРеквизита, "", "", Справочники.ИзделияЗаказчика.ПустаяСсылка());
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл 
		ЗаполнитьЗначенияСвойств(стВозврата, Выборка);
	КонецЦикла;   
	
	Возврат стВозврата;
	

КонецФункции // ПолучитьКомментарийОбъекта()

Функция ПолучитьРесурсПоУИД(УИДКарточки) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КанбанКарточки.Ресурс КАК Ресурс
		|ИЗ
		|	РегистрСведений.КанбанКарточки КАК КанбанКарточки
		|ГДЕ
		|	КанбанКарточки.УИД = &УИД";
	
	Запрос.УстановитьПараметр("УИД", УИДКарточки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ресурс;
	КонецЦикла;
	
КонецФункции // ПолучитьРесурсПоУИД()

Функция ПолучитьКомплектыНаСтопе(УИДДоски) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КанбанКарточки.Ресурс КАК Ресурс
		|ИЗ
		|	РегистрСведений.КанбанПереходКарточки.СрезПоследних КАК КанбанПереходКарточкиСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанКарточки КАК КанбанКарточки
		|		ПО КанбанПереходКарточкиСрезПоследних.УИДКарточка = КанбанКарточки.УИД
		|ГДЕ
		|	КанбанПереходКарточкиСрезПоследних.УИДКудаДорожка = ""200""
		|	И КанбанКарточки.Доска = &Доска
		|
		|УПОРЯДОЧИТЬ ПО
		|	КанбанКарточки.Ресурс.Наименование";
	
	Запрос.УстановитьПараметр("Доска", УИДДоски);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ресурс");
	
КонецФункции // ПолучитьКомплектыНаСтопе()


#Область ДополнительныеКоманды 

Процедура СоздатьЗадачуКонтрольЗадачи(УИДКарточки) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КанбанКарточки.Ресурс КАК ОбъектТЗ,
		|	ЕСТЬNULL(ПринятьТЗ.Ссылка, ЗНАЧЕНИЕ(Задача.ПринятьТЗ.ПустаяСсылка)) КАК ЗадачаПринятьТЗ,
		|	КанбанКарточки.Ресурс.Проект КАК Проект
		|ИЗ
		|	РегистрСведений.КанбанКарточки КАК КанбанКарточки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.ПринятьТЗ КАК ПринятьТЗ
		|		ПО КанбанКарточки.Ресурс = ПринятьТЗ.ОбъектТЗ
		|ГДЕ
		|	КанбанКарточки.УИД = &УИДКарточки";
	
	Запрос.УстановитьПараметр("УИДКарточки", УИДКарточки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(Выборка.ЗадачаПринятьТЗ) Тогда
			
			ЗадачаПринятьТЗ = Задачи.ПринятьТЗ.СоздатьЗадачу();
			ЗадачаПринятьТЗ.Наименование 			= Строка(Выборка.ОбъектТЗ) + " проверить ТЗ";
			ЗадачаПринятьТЗ.Дата 					= ТекущаяДата();
			ЗадачаПринятьТЗ.ОбъектТЗ 				= Выборка.ОбъектТЗ;
			ЗадачаПринятьТЗ.Версия 				= 1;
			ЗадачаПринятьТЗ.Проект 				= Выборка.Проект;
			ЗадачаПринятьТЗ.Статус 				= 0;
			ЗадачаПринятьТЗ.КрайняяДатаИсполнения 	= ЗадачаПринятьТЗ.Дата + 24 * 3600 * 3;
			ЗадачаПринятьТЗ.Исполнитель 			= омСотрудники.СотрудникиОбъекта(Выборка.ОбъектТЗ).ВедущийКонструктор;
			
			ЗадачаПринятьТЗ.Записать();
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


	
#КонецОбласти
